---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RoofFailures.RoofToRefPlanesError
source: html/e602ac7a-bc1b-53ab-de94-99e9840300c5.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RoofFailures.RoofToRefPlanesError Property

Roof cannot be joined to more than one reference plane.

## Syntax (C#)
```csharp
public static FailureDefinitionId RoofToRefPlanesError { get; }
```